{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "b0c8f26e-f64a-4b5b-b28f-909c1facfd69",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pyspark.sql import SparkSession\n",
    "from pyspark.conf import SparkConf\n",
    "from graphframes import *\n",
    "from pyspark.sql.functions import col, asc, desc, expr, split, sum, count, size\n",
    "\n",
    "spark_conf = SparkConf()\n",
    "spark_conf.setAll([\n",
    "    ('spark.master', \"local[*]\"),\n",
    "    # ('spark.master', \"spark://spark-master:7077\"),\n",
    "    ('spark.app.name', 'bigdata-graphx'),\n",
    "    ('spark.submit.deployMode', 'client'),\n",
    "    (\"spark.jars\", \"neo4j-connector-apache-spark_2.12-5.0.0_for_spark_3.jar\"),\n",
    "    (\"spark.jars.packages\", \"graphframes:graphframes:0.8.1-spark3.0-s_2.12\"),\n",
    "])\n",
    "\n",
    "spark = (\n",
    "    SparkSession\n",
    "    .builder\n",
    "    .config(conf=spark_conf)\n",
    "    .getOrCreate()\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "0c54f1e3-eabb-42b7-b749-8c0d09821468",
   "metadata": {},
   "outputs": [],
   "source": [
    "transactions_df = (\n",
    "    spark.read\n",
    "    .format(\"org.neo4j.spark.DataSource\")\n",
    "    .option(\"url\", \"bolt://neo4j:7687\")\n",
    "    .option(\"query\", \"MATCH (t:Transaction) RETURN t.txid as id\")\n",
    "    .load()\n",
    ")\n",
    "\n",
    "depends_df = (\n",
    "    spark.read\n",
    "    .format(\"org.neo4j.spark.DataSource\")\n",
    "    .option(\"url\", \"bolt://neo4j:7687\")\n",
    "    .option(\"query\", \"MATCH (src:Transaction) -[r:Depends]- (dst:Transaction) RETURN src.txid as src, dst.txid as dst\")\n",
    "    .load()\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "fdad4176-1f53-430a-a043-0542fabb891c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------+\n",
      "|                  id|\n",
      "+--------------------+\n",
      "|39704e617bfdfd221...|\n",
      "|491efc402a77a1357...|\n",
      "|bf77749b40ef1ea0a...|\n",
      "|3b125da136a7d7bd3...|\n",
      "|253507ece0a3288c0...|\n",
      "|3c7c7497b5b29147d...|\n",
      "|1d90e51bb3d874bdc...|\n",
      "|b85d97ef3a6533338...|\n",
      "|a8c940be35c23e9bb...|\n",
      "|f090f5d02ebdd07a5...|\n",
      "|d1815dd261c6f82cc...|\n",
      "|c540bd1a2c935b369...|\n",
      "|db14a0b2f1b4a93d7...|\n",
      "|fe6f5d32629b91853...|\n",
      "|481f7cc9e183919ec...|\n",
      "|6613dca6ce1b4db3a...|\n",
      "|45c53cfe6c7e7c0bb...|\n",
      "|8ceeb21ce50c918fa...|\n",
      "|25506175ac667075d...|\n",
      "|7c1c73c9e6bf99606...|\n",
      "+--------------------+\n",
      "only showing top 20 rows\n",
      "\n",
      "+--------------------+--------------------+\n",
      "|                 src|                 dst|\n",
      "+--------------------+--------------------+\n",
      "|253507ece0a3288c0...|8b4c1dedec8261111...|\n",
      "|253507ece0a3288c0...|8b4c1dedec8261111...|\n",
      "|253507ece0a3288c0...|c1498dff2a424069c...|\n",
      "|3c7c7497b5b29147d...|8dc053f141a2b4330...|\n",
      "|3c7c7497b5b29147d...|8dc053f141a2b4330...|\n",
      "|3c7c7497b5b29147d...|7c1c73c9e6bf99606...|\n",
      "|3c7c7497b5b29147d...|475ecc4a73dbab90e...|\n",
      "|1d90e51bb3d874bdc...|862eecbc8334cf9cb...|\n",
      "|1d90e51bb3d874bdc...|862eecbc8334cf9cb...|\n",
      "|b85d97ef3a6533338...|364ccb1accecc508f...|\n",
      "|b85d97ef3a6533338...|920ce572e2b171a0a...|\n",
      "|b85d97ef3a6533338...|b431e5eb9d97ed373...|\n",
      "|a8c940be35c23e9bb...|7326ae68fa17cbd5e...|\n",
      "|a8c940be35c23e9bb...|7326ae68fa17cbd5e...|\n",
      "|f090f5d02ebdd07a5...|a082669c2a7aaa8ab...|\n",
      "|f090f5d02ebdd07a5...|a082669c2a7aaa8ab...|\n",
      "|fe6f5d32629b91853...|a4258917f90f56344...|\n",
      "|481f7cc9e183919ec...|8956c056e59b15d75...|\n",
      "|481f7cc9e183919ec...|9fc716cef7ea0820c...|\n",
      "|481f7cc9e183919ec...|6f1cce5e64aeab428...|\n",
      "+--------------------+--------------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "transactions_df.show()\n",
    "depends_df.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "e73aeb72-9b9b-4971-bf13-7a17c44c1c92",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/conda/lib/python3.8/site-packages/pyspark/sql/dataframe.py:148: UserWarning: DataFrame.sql_ctx is an internal property, and will be removed in future releases. Use DataFrame.sparkSession instead.\n",
      "  warnings.warn(\n",
      "/opt/conda/lib/python3.8/site-packages/pyspark/sql/dataframe.py:127: UserWarning: DataFrame constructor is internal. Do not directly use it.\n",
      "  warnings.warn(\"DataFrame constructor is internal. Do not directly use it.\")\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------+------+\n",
      "|                  id|degree|\n",
      "+--------------------+------+\n",
      "|dddba850442bc1f57...|    58|\n",
      "|09e4f33d2c096cddd...|    52|\n",
      "|81312f4c21f97eeaa...|    52|\n",
      "|945bb3e35cb88b204...|    42|\n",
      "|b534ac542b6785757...|    40|\n",
      "|c21c910fb499431ed...|    24|\n",
      "|dac027764110d5007...|    24|\n",
      "|b5d73bd817905afe9...|    20|\n",
      "|4ed8f86075d677763...|    14|\n",
      "|d506c987e46d6ac44...|    14|\n",
      "|933509337ce88ee7c...|    14|\n",
      "|d0a618f2b2c753a8e...|    14|\n",
      "|581d457391b2ff4dc...|    14|\n",
      "|f0eeb33e9b1e0c074...|    12|\n",
      "|a75e25d6af6f6b71e...|    12|\n",
      "|02a96836568b6e587...|    12|\n",
      "|8dc053f141a2b4330...|    12|\n",
      "|f00d2a8c1c2222592...|    12|\n",
      "|7326ae68fa17cbd5e...|    12|\n",
      "|8e01e8faed57e6a4c...|    12|\n",
      "+--------------------+------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "graph = GraphFrame(transactions_df, depends_df)\n",
    "graph.degrees.sort(col('degree').desc()).show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "d25ee478-b286-4e46-8984-0bfb78e2431d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------+--------------------+---------------+\n",
      "|                  id|           distances|distanse_length|\n",
      "+--------------------+--------------------+---------------+\n",
      "|a17891e701c872e63...|{e7d09c85437d92da...|            282|\n",
      "|11bcf9c547597b50b...|{e7d09c85437d92da...|            282|\n",
      "|253507ece0a3288c0...|{e7d09c85437d92da...|            282|\n",
      "|7517d5ba7f46e5b2e...|{e7d09c85437d92da...|            282|\n",
      "|1d90e51bb3d874bdc...|{e7d09c85437d92da...|            282|\n",
      "|3c7c7497b5b29147d...|{e7d09c85437d92da...|            282|\n",
      "|b85d97ef3a6533338...|{e7d09c85437d92da...|            282|\n",
      "|481f7cc9e183919ec...|{e7d09c85437d92da...|            282|\n",
      "|fe6f5d32629b91853...|{e7d09c85437d92da...|            282|\n",
      "|7c1c73c9e6bf99606...|{e7d09c85437d92da...|            282|\n",
      "|37941a7a4c54978dd...|{e7d09c85437d92da...|            282|\n",
      "|bb3fc79cd7148d2bc...|{e7d09c85437d92da...|            282|\n",
      "|f2e9991efb16c57a3...|{e7d09c85437d92da...|            282|\n",
      "|9c212ab0fcd23db28...|{e7d09c85437d92da...|            282|\n",
      "|42e067dc25790afc0...|{e7d09c85437d92da...|            282|\n",
      "|b1b80f00f8f0448cd...|{e7d09c85437d92da...|            282|\n",
      "|8b4c1dedec8261111...|{e7d09c85437d92da...|            282|\n",
      "|d78f285fe850d668f...|{e7d09c85437d92da...|            282|\n",
      "|43ba032a7ac97ca80...|{e7d09c85437d92da...|            282|\n",
      "|45c53cfe6c7e7c0bb...|{e7d09c85437d92da...|            282|\n",
      "+--------------------+--------------------+---------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#tx graph diameter\n",
    "landmarks = graph.vertices.rdd.map(lambda x: x.id).collect()\n",
    "transactions_paths = graph.shortestPaths(landmarks = landmarks)\n",
    "(\n",
    "    transactions_paths.select(\"id\",\"distances\")\n",
    "    .transform(lambda tx: tx.withColumn(\"distanse_length\", size(col(\"distances\"))))\n",
    "    .orderBy(col('distanse_length').desc())\n",
    "    .show(truncate=True)\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "14d180fc-6d54-40c1-8bf1-4751c32decae",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------+-----------+\n",
      "|                 src|utxos_count|\n",
      "+--------------------+-----------+\n",
      "|dddba850442bc1f57...|         29|\n",
      "|09e4f33d2c096cddd...|         26|\n",
      "|81312f4c21f97eeaa...|         26|\n",
      "|945bb3e35cb88b204...|         21|\n",
      "|b534ac542b6785757...|         20|\n",
      "|dac027764110d5007...|         12|\n",
      "|c21c910fb499431ed...|         12|\n",
      "|b5d73bd817905afe9...|         10|\n",
      "|4ed8f86075d677763...|          7|\n",
      "|933509337ce88ee7c...|          7|\n",
      "|d506c987e46d6ac44...|          7|\n",
      "|d0a618f2b2c753a8e...|          7|\n",
      "|581d457391b2ff4dc...|          7|\n",
      "|8dc053f141a2b4330...|          6|\n",
      "|02a96836568b6e587...|          6|\n",
      "|8e01e8faed57e6a4c...|          6|\n",
      "|3f8afc226c20e2cf5...|          6|\n",
      "|8a788b6f4505dd361...|          6|\n",
      "|f0eeb33e9b1e0c074...|          6|\n",
      "|61763bb94c642fa2d...|          6|\n",
      "+--------------------+-----------+\n",
      "only showing top 20 rows\n",
      "\n",
      "+--------------------+-------------+\n",
      "|                 dst|outputs_count|\n",
      "+--------------------+-------------+\n",
      "|dddba850442bc1f57...|           29|\n",
      "|81312f4c21f97eeaa...|           26|\n",
      "|09e4f33d2c096cddd...|           26|\n",
      "|945bb3e35cb88b204...|           21|\n",
      "|b534ac542b6785757...|           20|\n",
      "|c21c910fb499431ed...|           12|\n",
      "|dac027764110d5007...|           12|\n",
      "|b5d73bd817905afe9...|           10|\n",
      "|4ed8f86075d677763...|            7|\n",
      "|d506c987e46d6ac44...|            7|\n",
      "|933509337ce88ee7c...|            7|\n",
      "|d0a618f2b2c753a8e...|            7|\n",
      "|581d457391b2ff4dc...|            7|\n",
      "|02a96836568b6e587...|            6|\n",
      "|f0eeb33e9b1e0c074...|            6|\n",
      "|a75e25d6af6f6b71e...|            6|\n",
      "|7326ae68fa17cbd5e...|            6|\n",
      "|8e01e8faed57e6a4c...|            6|\n",
      "|8dc053f141a2b4330...|            6|\n",
      "|3f8afc226c20e2cf5...|            6|\n",
      "+--------------------+-------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# depends_df.show()\n",
    "\n",
    "maxUtxoCount = (\n",
    "    depends_df\n",
    "    .groupBy(\"src\")\n",
    "    .agg(count(\"dst\").alias(\"utxos_count\"))\n",
    "    .orderBy(col(\"utxos_count\").desc())\n",
    "    .show()\n",
    ")\n",
    "\n",
    "maxOutputsCount = (\n",
    "    depends_df\n",
    "    .groupBy(\"dst\")\n",
    "    .agg(count(\"src\").alias(\"outputs_count\"))\n",
    "    .orderBy(col(\"outputs_count\").desc())\n",
    "    .show()\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "3ccea8c3-7d95-434a-975f-cf8d47487314",
   "metadata": {},
   "outputs": [],
   "source": [
    "accounts_df = (\n",
    "    spark.read\n",
    "    .format(\"org.neo4j.spark.DataSource\")\n",
    "    .option(\"url\", \"bolt://neo4j:7687\")\n",
    "    .option(\"query\", \"MATCH (t:Account) RETURN a.address as id\")\n",
    "    .load()\n",
    ")\n",
    "\n",
    "transactions_df = (\n",
    "    spark.read\n",
    "    .format(\"org.neo4j.spark.DataSource\")\n",
    "    .option(\"url\", \"bolt://neo4j:7687\")\n",
    "    .option(\"query\", \"MATCH (src:Account) -[s:Send]-> (t:Transaction) -[r:Receive]-> (dst:Account) RETURN src.address as src, dst.address as dst, t.txid as txid\")\n",
    "    .load()\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "2914b876-f3b8-47a5-a0bf-7f62a035cfa9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+--------------------+-------------+\n",
      "|                txid|senders_count|\n",
      "+--------------------+-------------+\n",
      "|dddba850442bc1f57...|           26|\n",
      "|81312f4c21f97eeaa...|           24|\n",
      "|09e4f33d2c096cddd...|           22|\n",
      "|945bb3e35cb88b204...|           20|\n",
      "|68f40f4a9cf422dd9...|           17|\n",
      "|a0e5bbc6c348b9256...|           17|\n",
      "|4008d74217e2121f9...|           16|\n",
      "|c21c910fb499431ed...|           13|\n",
      "|dac027764110d5007...|           13|\n",
      "|b534ac542b6785757...|           13|\n",
      "|9f87948d2c89556d9...|           10|\n",
      "|2ce2e39c18be37239...|            8|\n",
      "|d6d2537e1a72a11f2...|            5|\n",
      "|2b333194f53c5be4d...|            5|\n",
      "|b76f80a4484345441...|            5|\n",
      "|a5124297548d4675a...|            5|\n",
      "|7020d5196c717b3cd...|            5|\n",
      "|fbfa112d510e93607...|            4|\n",
      "|1f7ee75cefac13cdf...|            4|\n",
      "|9535487e8e34e5c15...|            4|\n",
      "+--------------------+-------------+\n",
      "only showing top 20 rows\n",
      "\n",
      "+--------------------+----------------+\n",
      "|                txid|recipients_count|\n",
      "+--------------------+----------------+\n",
      "|dddba850442bc1f57...|              26|\n",
      "|0ee4aa03ca9b75fc7...|              24|\n",
      "|81312f4c21f97eeaa...|              24|\n",
      "|3f8afc226c20e2cf5...|              23|\n",
      "|e7d09c85437d92dac...|              22|\n",
      "|09e4f33d2c096cddd...|              22|\n",
      "|b5d73bd817905afe9...|              21|\n",
      "|06370d4906184bf60...|              21|\n",
      "|945bb3e35cb88b204...|              20|\n",
      "|f0eeb33e9b1e0c074...|              20|\n",
      "|8e01e8faed57e6a4c...|              20|\n",
      "|0bac5b40b3b3c838e...|              18|\n",
      "|124fa66003f569fa2...|              18|\n",
      "|a3a8f576c72475e52...|              16|\n",
      "|c3c86c257c843daf2...|              14|\n",
      "|b534ac542b6785757...|              13|\n",
      "|c21c910fb499431ed...|              13|\n",
      "|dac027764110d5007...|              13|\n",
      "|c06060d82c4ef1e8a...|              13|\n",
      "|f00d2a8c1c2222592...|              12|\n",
      "+--------------------+----------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# maximum number of unique senders in 1 transaction\n",
    "\n",
    "# transactions_df.show()\n",
    "\n",
    "maxSenders = (\n",
    "    transactions_df\n",
    "    .dropDuplicates([\"src\", \"txid\"])\n",
    "    .groupBy(\"txid\")\n",
    "    .agg(count(\"src\").alias(\"senders_count\"))\n",
    "    .orderBy(col(\"senders_count\").desc())\n",
    ")\n",
    "\n",
    "maxSenders.show(truncate=True)\n",
    "\n",
    "maxRecipients = (\n",
    "    transactions_df\n",
    "    .dropDuplicates([\"dst\", \"txid\"])\n",
    "    .groupBy(\"txid\")\n",
    "    .agg(count(\"dst\").alias(\"recipients_count\"))\n",
    "    .orderBy(col(\"recipients_count\").desc())\n",
    ")\n",
    "\n",
    "maxRecipients.show(truncate=True)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
